--

1. GameEngine:
   - Описание: Основной движок игры, управляющий логикой игры.

2. Mage:
   - Описание: Представление мага-игрока или компьютерного противника, управление характеристиками и принятие решений во время дуэли.

3. Deck:
   - Описание: Управление колодой магических карт, включая создание, редактирование и сохранение.

4. Card:
   - Описание: Представление отдельной магической карты в колоде, содержащей информацию о типе магии, атакующих и защитных свойствах.

5. UI (User Interface):
   - Описание: Визуализация игрового процесса и обеспечение взаимодействия с пользователем через различные экраны.

6. ProgressSystem:
   - Описание: Система отслеживания прогресса игрока, достижений и предоставления возможности улучшать колоду и магические способности.

--

