Документация к проекту "Магическая битва"


Программные требования:
1. Python:
   - Версия Python 3.x.

Зависимости:
1. Отсутствуют:
   - Проект не требует установки дополнительных библиотек.

Сборка проекта:

Шаг 1: Установка Python:
   - Убедитесь, что на вашем компьютере установлена версия Python 3.x. Вы можете скачать ее с [официального сайта Python](https://www.python.org/).

Шаг 2: Клонирование репозитория (если используется система контроля версий):
   - Cклонируйте репозиторий в желаемую директорию:
     git clone https://github.com/EvVPEvVP/hexlet-git/blob/main/2b4_11.py
     
Шаг 3: Запуск проекта:

   - Запустите основной файл с примером кода:
     python3 2b4_11.py
 

