--

1. Список (List) для хранения карт в руке игрока:
   - Описание: Упорядоченная коллекция карт, которые могут быть добавлены или удалены в процессе игры.

2. Массив (Array) для представления колоды:
   - Описание: Mассив, представляющий колоду магических карт. Позволяет быстрый доступ по индексу.

3. Стек (Stack) для реализации системы фаз хода:
   - Описание: Хранит текущую фазу хода и обеспечивает добавление и удаление фаз в стеке.

4. Словарь (Dictionary/Map) для хранения характеристик магов:
   - Описание: Каждому магу соответствует словарь с его уникальными характеристиками.

5. Связанный список (Linked List) для реализации истории ходов:
   - Описание: Хранит последовательность ходов в виде связанного списка для возможности отката к предыдущим состояниям.

6. Хэш-таблица (Hash Table) для быстрого доступа к картам по их идентификаторам:
   - Описание: Обеспечивает поиск и доступ к конкретным картам по их уникальным идентификаторам.

--

